# AssemblyViewUtils.CreateDetailSection Method

---
| Name| Description
---|---|---
| CreateDetailSection(Document, ElementId, AssemblyDetailViewOrientation)|  Creates a new detail section assembly view for the assembly instance.
| CreateDetailSection(Document, ElementId, AssemblyDetailViewOrientation, ElementId, Boolean)|  Creates a new detail section assembly view for the assembly instance.
Top
#### Reference
AssemblyViewUtils Class
Autodesk.Revit.DB Namespace